alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREcommon.cpp
                    buf[1] = 3;
                    memcpy(&buf[2], &leftOffset, sizeof(int));
                    Serial.write(buf, sizeof(buf));
                    Serial.flush();

                    // Set mouse movement to right position
                    if(!fromDesktop) {
                        mouseTargetX = 32767;
                        mouseTargetY = 32768 / 2;
                        mouseMoving = true;
                    }
                    break;
                case FW_Const::Cali_Center:
                    // Set Offset buffer
                    rightOffset = (res_x - mouseX);

                    buf[1] = 4;
                    memcpy(&buf[2], &rightOffset, sizeof(int));
                    Serial.write(buf, sizeof(buf));
                    Serial.flush();

                    // Save Offset buffer to profile
                    OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset = topOffset;
                    OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset = bottomOffset;
                    OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset = leftOffset;
                    OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset = rightOffset;

                    // Move back to center calibration point
                    if(!fromDesktop) {
                        mouseTargetX = 32768 / 2;
                        mouseTargetY = 32768 / 2;
                        mouseMoving = true;
                    }
                    break;
                case FW_Const::Cali_Verify:
                    // Apply new Cam center offsets with Offsets applied using dynamic CENTER_X and CENTER_Y
                    if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout) {
                        OF_Prefs::profiles[OF_Prefs::currentProfile].adjX = (OpenFIREdiamond.testMedianX() - CENTER_X) * cos(OpenFIREdiamond.Ang()) -
                                                                             (OpenFIREdiamond.testMedianY() - CENTER_Y) * sin(OpenFIREdiamond.Ang()) + CENTER_X;
                        OF_Prefs::profiles[OF_Prefs::currentProfile].adjY = (OpenFIREdiamond.testMedianX() - CENTER_X) * sin(OpenFIREdiamond.Ang()) +
                                                                             (OpenFIREdiamond.testMedianY() - CENTER_Y) * cos(OpenFIREdiamond.Ang()) + CENTER_Y;
                    } else {
                        OF_Prefs::profiles[OF_Prefs::currentProfile].adjX = (OpenFIREsquare.testMedianX() - CENTER_X) * cos(OpenFIREsquare.Ang()) -
                                                                             (OpenFIREsquare.testMedianY() - CENTER_Y) * sin(OpenFIREsquare.Ang()) + CENTER_X;
                        OF_Prefs::profiles[OF_Prefs::currentProfile].adjY = (OpenFIREsquare.testMedianX() - CENTER_X) * sin(OpenFIREsquare.Ang()) +
                                                                             (OpenFIREsquare.testMedianY() - CENTER_Y) * cos(OpenFIREsquare.Ang()) + CENTER_Y;
                    }

                    buf[1] = 5;
                    memcpy(&buf[2], &OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, sizeof(float));
                    Serial.write(buf, sizeof(buf));
                    Serial.flush();

                    buf[1] = 6;
                    memcpy(&buf[2], &OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, sizeof(float));
                    Serial.write(buf, sizeof(buf));
                    Serial.flush();

                    // Update Cam centre in perspective library
                    OpenFIREper.source(OF_Prefs::profiles[OF_Prefs::currentProfile].adjX, OF_Prefs::profiles[OF_Prefs::currentProfile].adjY);
                    OpenFIREper.deinit(0);

                    // Let the user test.
                    SetMode(FW_Const::GunMode_Verification);
                    while(gunMode == FW_Const::GunMode_Verification) {
                        buttons.Poll();

                        if(irPosUpdateTick) {
                            irPosUpdateTick = 0;
                            GetPosition();
                        }

                        // If it's good, move onto calibration finish.
                        if(buttons.pressed == FW_Const::BtnMask_Trigger) {
                            calStage++;
                            // Stay in Verification Mode; the code outside of the calibration loop will catch us.
                            break;
                        // Press A/B to restart calibration for current profile
                        } else if(buttons.pressedReleased & FW_Const::ExitPauseModeHoldBtnMask) {
                            calStage = 0;
                            Serial.printf("%c%c", OF_Const::sCaliStageUpd, FW_Const::Cali_Init);
                            Serial.flush();

                            // (Re)set current values to factory defaults
                            OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset = 0;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset = 0;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset = 0;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset = 0;
                            
                            // RESET DEL CENTRO OTTICO USANDO I VALORI DINAMICI
                            OF_Prefs::profiles[OF_Prefs::currentProfile].adjX = CENTER_X;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].adjY = CENTER_Y;
                            
                            SetMode(FW_Const::GunMode_Calibration);
                            AbsMouse5.move(32768/2, 32768/2);
                            AbsMouse5.report();
                        // Press C/Home to exit without committing new calibration values
                        } else if(buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask && !justBooted) {
                            Serial.printf("%c%c", OF_Const::sCaliStageUpd, FW_Const::Cali_Verify+1);
                            Serial.flush();

