alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREcommon.cpp
                            // Reapply backed-up data
                            OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset = _topOffset;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset = _bottomOffset;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset = _leftOffset;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset = _rightOffset;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].TLled = _TLled;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].TRled = _TRled;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].adjX = _adjX;
                            OF_Prefs::profiles[OF_Prefs::currentProfile].adjY = _adjY;

                            // Re-print the profile
                            stateFlags |= FW_Const::StateFlag_PrintSelectedProfile;

                            // Re-apply the calibration stored in the profile
                            if(fromDesktop)
                                SetMode(FW_Const::GunMode_Docked);
                            else SetMode(FW_Const::GunMode_Run);
                            return;
                        }
                    }
                    break;
                default:
                    break;
            }
        }
    }

    // Break calibration
    if(justBooted) {
        // If this is an initial calibration, save it immediately!
        stateFlags |= FW_Const::StateFlag_SavePreferencesEn;
        SavePreferences();
        if(fromDesktop)
            SetMode(FW_Const::GunMode_Docked);
    } else if(fromDesktop) {
        SetMode(FW_Const::GunMode_Docked);
    } else SetMode(FW_Const::GunMode_Run);

    #ifdef USES_RUMBLE
        if(OF_Prefs::toggles[OF_Const::rumble]) {
            analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
            delay(80);
            #ifdef ARDUINO_ARCH_ESP32
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);  // [ESP32_PORT] per EPS32
            #else // rp2040
            digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
            #endif
            delay(50);
            analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
            delay(125);
            #ifdef ARDUINO_ARCH_ESP32
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);  // [ESP32_PORT] per ESP32
            #else // rp2040            
            digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
            #endif
        }
    #endif // USES_RUMBLE

    Serial.printf("%c%c", OF_Const::sCaliStageUpd, FW_Const::Cali_Verify+1);
    Serial.flush();
}

void FW_Common::GetPosition()
{
    // Dynamic camera coordinate resolution in the internal Mouse precision space.
    constexpr int CAM_COORD_RES_X = MouseResX;
    constexpr int CAM_COORD_RES_Y = MouseResY;

    // Perspective code uses 2 extra precision bits (res_x/res_y are << 2).
    constexpr int PERSPECTIVE_SCALE = 1 << 2;
    constexpr int SCREEN_RES_X = res_x / PERSPECTIVE_SCALE;
    constexpr int SCREEN_RES_Y = res_y / PERSPECTIVE_SCALE;

    // Preserve the camera aspect ratio when displaying RAW camera coordinates
    // inside the 1920x1080 Processing/test canvas.
    constexpr bool CAM_TEST_WIDTH_LIMITED =
        (CAM_COORD_RES_X * SCREEN_RES_Y) >
        (CAM_COORD_RES_Y * SCREEN_RES_X);

    constexpr int CAM_TEST_WIDTH =
    CAM_TEST_WIDTH_LIMITED
        ? SCREEN_RES_X
        : (CAM_COORD_RES_X * SCREEN_RES_Y) / CAM_COORD_RES_Y;

    constexpr int CAM_TEST_HEIGHT =
    CAM_TEST_WIDTH_LIMITED
        ? (CAM_COORD_RES_Y * SCREEN_RES_X) / CAM_COORD_RES_X
        : SCREEN_RES_Y;

    constexpr int CAM_TEST_OFFSET_X =
        (SCREEN_RES_X - CAM_TEST_WIDTH) / 2;

    constexpr int CAM_TEST_OFFSET_Y =
        (SCREEN_RES_Y - CAM_TEST_HEIGHT) / 2;

    // Target aspect ratio used by Serial AR correction: 4:3 content.
    constexpr int AR_CORRECTION_W = 4;
    constexpr int AR_CORRECTION_H = 3;

    if(dfrIRPos != nullptr) {
        int error = dfrIRPos->basicAtomic(DFRobotIRPositionEx::Retry_2);
        if(error == DFRobotIRPositionEx::Error_Success) {
           
            // if diamond layout, or square
            if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout) { // layoutDiamond = 1
                OpenFIREdiamond.begin(dfrIRPos->xPositions(), dfrIRPos->yPositions(), dfrIRPos->seen());

                OpenFIREper.warp(OpenFIREdiamond.X(0), OpenFIREdiamond.Y(0),
                                 OpenFIREdiamond.X(1), OpenFIREdiamond.Y(1),
                                 OpenFIREdiamond.X(2), OpenFIREdiamond.Y(2),
                                 OpenFIREdiamond.X(3), OpenFIREdiamond.Y(3),
                                 res_x / 2, 0, 0,
                                 res_y / 2, res_x / 2,
                                 res_y, res_x, res_y / 2);
            } else { // layoutSquare = 0
                OpenFIREsquare.begin(dfrIRPos->xPositions(), dfrIRPos->yPositions(), dfrIRPos->seen());               
               
                #ifdef USE_MULTI_ONE_EURO_FILTER
                    X_in[0] = OpenFIREsquare.X(0);
                    Y_in[0] = OpenFIREsquare.Y(0);
                    X_in[1] = OpenFIREsquare.X(1);
                    Y_in[1] = OpenFIREsquare.Y(1);
                    X_in[2] = OpenFIREsquare.X(2);
                    Y_in[2] = OpenFIREsquare.Y(2);
                    X_in[3] = OpenFIREsquare.X(3);
                    Y_in[3] = OpenFIREsquare.Y(3);          

                    oef_multi.process(X_in, Y_in, X_out, Y_out);

                    OpenFIREper.warp(X_out[0], Y_out[0],
                                 X_out[1], Y_out[1],
                                 X_out[2], Y_out[2],
                                 X_out[3], Y_out[3],
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, 0,
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, 0,
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, res_y,
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, res_y);
   
                #else
                    OpenFIREper.warp(OpenFIREsquare.X(0), OpenFIREsquare.Y(0),
                                 OpenFIREsquare.X(1), OpenFIREsquare.Y(1),
                                 OpenFIREsquare.X(2), OpenFIREsquare.Y(2),
                                 OpenFIREsquare.X(3), OpenFIREsquare.Y(3),
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, 0,
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, 0,
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TLled, res_y,
                                 OF_Prefs::profiles[OF_Prefs::currentProfile].TRled, res_y);
                #endif // USE_MULTI_ONE_EURO_FILTER

