alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREcommon.cpp
            }

            // Output mapped to screen resolution because offsets are measured in pixels
            mouseX = map(OpenFIREper.getX(), 0, res_x, (0 - OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset), (res_x + OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset));                 
            mouseY = map(OpenFIREper.getY(), 0, res_y, (0 - OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset), (res_y + OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset));         

            switch(runMode) {
                case FW_Const::RunMode_Average:
                    // 2 position moving average
                    moveIndex ^= 1;
                    moveXAxisArr[moveIndex] = mouseX;
                    moveYAxisArr[moveIndex] = mouseY;
                    mouseX = (moveXAxisArr[0] + moveXAxisArr[1]) / 2;
                    mouseY = (moveYAxisArr[0] + moveYAxisArr[1]) / 2;
                    break;

                case FW_Const::RunMode_Average2:
                    // weighted average of current position and previous 2
                    if(moveIndex < 2)
                        ++moveIndex;
                    else moveIndex = 0;

                    moveXAxisArr[moveIndex] = mouseX;
                    moveYAxisArr[moveIndex] = mouseY;
                    mouseX = (mouseX + moveXAxisArr[0] + moveXAxisArr[1] + moveXAxisArr[2]) / 4;
                    mouseY = (mouseY + moveYAxisArr[0] + moveYAxisArr[1] + moveYAxisArr[2]) / 4;
                    break;

                default:
                    break;
            }

            // Constrain that bisch so negatives don't cause underflow
            int32_t conMoveX = constrain(mouseX, 0, res_x);
            int32_t conMoveY = constrain(mouseY, 0, res_y);

            if(gunMode == FW_Const::GunMode_Run) {
                UpdateLastSeen();

                if(OF_Serial::serialARcorrection) switch(OF_Prefs::profiles[OF_Prefs::currentProfile].aspectRatio) {
                    case OF_Const::ar16_9: {
                        // Fit centered 4:3 content inside a 16:9 display.
                        constexpr int correctedWidth =
                            (res_x * AR_CORRECTION_W * 9) /
                            (AR_CORRECTION_H * 16);

                        constexpr int correctionX =
                            (res_x - correctedWidth) / 2;

                        conMoveX = map(conMoveX, correctionX, res_x - correctionX, 0, 32767);
                        conMoveX = constrain(conMoveX, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                    }

                    case OF_Const::ar16_10: {
                        // Fit centered 4:3 content inside a 16:10 display.
                        constexpr int correctedWidth =
                            (res_x * AR_CORRECTION_W * 10) /
                            (AR_CORRECTION_H * 16);

                        constexpr int correctionX =
                            (res_x - correctedWidth) / 2;

                        conMoveX = map(conMoveX, correctionX, res_x - correctionX, 0, 32767);
                        conMoveX = constrain(conMoveX, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                    }

                    case OF_Const::ar3_2: {
                        // Fit centered 4:3 content inside a 3:2 display.
                        constexpr int correctedWidth =
                            (res_x * AR_CORRECTION_W * 2) /
                            (AR_CORRECTION_H * 3);

                        constexpr int correctionX =
                            (res_x - correctedWidth) / 2;

                        conMoveX = map(conMoveX, correctionX, res_x - correctionX, 0, 32767);
                        conMoveX = constrain(conMoveX, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                    }

                    case OF_Const::ar5_4: {
                        // A 5:4 display is narrower than 4:3, so the correction
                        // is applied vertically instead of horizontally.
                        constexpr int correctedHeight =
                            (res_y * AR_CORRECTION_H * 5) /
                            (AR_CORRECTION_W * 4);

                        constexpr int correctionY =
                            (res_y - correctedHeight) / 2;

                        conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                        conMoveY = map(conMoveY, correctionY, res_y - correctionY, 0, 32767);
                        conMoveY = constrain(conMoveY, 0, 32767);
                        break;
                    }

                    case OF_Const::ar4_3:
                    default:
                        // Output mapped to Mouse resolution
                        conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                        conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                        break;
                } else {
                    // Output mapped to Mouse resolution
                    conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                    conMoveY = map(conMoveY, 0, res_y, 0, 32767);
                }

                bool offXAxis = false;
                bool offYAxis = false;

                if(conMoveX == 0 || conMoveX == 32767)
                    offXAxis = true;
               
                if(conMoveY == 0 || conMoveY == 32767)
                    offYAxis = true;

                if(offXAxis || offYAxis)
                     buttons.offScreen = true;
                else buttons.offScreen = false;

                if(buttons.analogOutput)
                     Gamepad16.moveCam(conMoveX, conMoveY);
                else AbsMouse5.move(conMoveX, conMoveY);

            } else {
                if(gunMode == FW_Const::GunMode_Verification) {
                    // Output mapped to Mouse resolution
                    conMoveX = map(conMoveX, 0, res_x, 0, 32767);
                    conMoveY = map(conMoveY, 0, res_y, 0, 32767);

                    AbsMouse5.move(conMoveX, conMoveY);
                    AbsMouse5.report();
                }

                if(millis() - testLastStamp > 50) {
                    testLastStamp = millis();
                    // RAW Camera Output mapped to screen res (1920x1080)
                    // Screen resolution is now dynamically derived from res_x/res_y.
                    int rawX[4];
                    int rawY[4];
                    bool outsideFov[4];

                    // RAW Output for viewing in processing sketch mapped to 1920x1080 screen resolution
                    for (int i = 0; i < 4; ++i) {
                        int pointX;
                        int pointY;

