alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREcommon.cpp
                        if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout) {
                            pointX = OpenFIREdiamond.X(i);
                            pointY = OpenFIREdiamond.Y(i);

                            rawX[i] = map(pointX, 0, CAM_COORD_RES_X,
                                          CAM_TEST_OFFSET_X + CAM_TEST_WIDTH, CAM_TEST_OFFSET_X);
                            rawY[i] = map(pointY, 0, CAM_COORD_RES_Y,
                                          CAM_TEST_OFFSET_Y, CAM_TEST_OFFSET_Y + CAM_TEST_HEIGHT);
                        } else {
                            pointX = OpenFIREsquare.X(i);
                            pointY = OpenFIREsquare.Y(i);

                            rawX[i] = map(pointX, 0, CAM_COORD_RES_X,
                                          CAM_TEST_OFFSET_X, CAM_TEST_OFFSET_X + CAM_TEST_WIDTH);
                            rawY[i] = map(pointY, 0, CAM_COORD_RES_Y,
                                          CAM_TEST_OFFSET_Y, CAM_TEST_OFFSET_Y + CAM_TEST_HEIGHT);
                        }

                        outsideFov[i] =
                            pointX < 0 || pointX > MouseMaxX ||
                            pointY < 0 || pointY > MouseMaxY;
                    }

                    if(runMode == FW_Const::RunMode_Processing) {
                        int mouseXscaled = mouseX / PERSPECTIVE_SCALE;
                        int mouseYscaled = mouseY / PERSPECTIVE_SCALE;

                        // Encode outside-FOV state in bit 0 of each transmitted X coordinate.
                        // Even X = inside FOV, odd X = outside FOV. rawX/rawY stay unchanged.
                        int serialX[4];
                        for(int i = 0; i < 4; ++i)
                            serialX[i] = rawX[i] * 2 + (outsideFov[i] ? 1 : 0);

                        if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout) {
                            int testMedianX = map(OpenFIREdiamond.testMedianX(), 0, CAM_COORD_RES_X,
                                                  CAM_TEST_OFFSET_X + CAM_TEST_WIDTH, CAM_TEST_OFFSET_X);
                            int testMedianY = map(OpenFIREdiamond.testMedianY(), 0, CAM_COORD_RES_Y,
                                                  CAM_TEST_OFFSET_Y, CAM_TEST_OFFSET_Y + CAM_TEST_HEIGHT);
                            char buf[49];
                            buf[0] = OF_Const::sTestCoords;
                            memcpy(&buf[1],  &serialX[0],      sizeof(int));
                            memcpy(&buf[5],  &rawY[0],      sizeof(int));
                            memcpy(&buf[9],  &serialX[1],      sizeof(int));
                            memcpy(&buf[13], &rawY[1],      sizeof(int));
                            memcpy(&buf[17], &serialX[2],      sizeof(int));
                            memcpy(&buf[21], &rawY[2],      sizeof(int));
                            memcpy(&buf[25], &serialX[3],      sizeof(int));
                            memcpy(&buf[29], &rawY[3],      sizeof(int));
                            memcpy(&buf[33], &mouseXscaled, sizeof(int));
                            memcpy(&buf[37], &mouseYscaled, sizeof(int));
                            memcpy(&buf[41], &testMedianX,  sizeof(int));
                            memcpy(&buf[45], &testMedianY,  sizeof(int));
                            Serial.write(buf, sizeof(buf));
                        } else {
                            int testMedianX = map(OpenFIREsquare.testMedianX(), 0, CAM_COORD_RES_X,
                                                  CAM_TEST_OFFSET_X, CAM_TEST_OFFSET_X + CAM_TEST_WIDTH);
                            int testMedianY = map(OpenFIREsquare.testMedianY(), 0, CAM_COORD_RES_Y,
                                                  CAM_TEST_OFFSET_Y, CAM_TEST_OFFSET_Y + CAM_TEST_HEIGHT);
                            char buf[49];
                            buf[0] = OF_Const::sTestCoords;
                            memcpy(&buf[1],  &serialX[0],      sizeof(int));
                            memcpy(&buf[5],  &rawY[0],      sizeof(int));
                            memcpy(&buf[9],  &serialX[1],      sizeof(int));
                            memcpy(&buf[13], &rawY[1],      sizeof(int));
                            memcpy(&buf[17], &serialX[2],      sizeof(int));
                            memcpy(&buf[21], &rawY[2],      sizeof(int));
                            memcpy(&buf[25], &serialX[3],      sizeof(int));
                            memcpy(&buf[29], &rawY[3],      sizeof(int));
                            memcpy(&buf[33], &mouseXscaled, sizeof(int));
                            memcpy(&buf[37], &mouseYscaled, sizeof(int));
                            memcpy(&buf[41], &testMedianX,  sizeof(int));
                            memcpy(&buf[45], &testMedianY,  sizeof(int));
                            Serial.write(buf, sizeof(buf));
                        }
                    }

                    #ifdef USES_DISPLAY
                        /*
                        for(int i = 0; i < 4; ++i) {
                            rawX[i] = map(rawX[i],
                                CAM_TEST_OFFSET_X,
                                CAM_TEST_OFFSET_X + CAM_TEST_WIDTH,
                                0, SCREEN_RES_X);

                            rawY[i] = map(rawY[i],
                                CAM_TEST_OFFSET_Y,
                                CAM_TEST_OFFSET_Y + CAM_TEST_HEIGHT,
                                0, SCREEN_RES_Y);
                        }
                        */
                        OLED.DrawVisibleIR(rawX, rawY);
                    #endif // USES_DISPLAY
                }
            }
        } else if(error != DFRobotIRPositionEx::Error_DataMismatch)
            PrintIrError();
    } else PrintIrError();
}

void FW_Common::PrintIrError()
{
    // set flag to warn desktop app when docking
    if(!camNotAvailable)
        camNotAvailable = true;

    if(dockedSaving) {
        char buf[2] = { OF_Const::sError, OF_Const::sErrCam };
        Serial.write(buf, 2);
    } else if(millis() - camWarningTimestamp > CAM_WARNING_INTERVAL) {
        Serial.println("CAMERROR: Not available");
        camWarningTimestamp = millis();
    }
}

void FW_Common::UpdateLastSeen()
{
    if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout) {
        if(lastSeen != OpenFIREdiamond.seen()) {
            #ifdef MAMEHOOKER
            if(!OF_Serial::serialMode)
            #endif // MAMEHOOKER
                #ifdef LED_ENABLE
                if(!lastSeen && OpenFIREdiamond.seen())
                    OF_RGB::LedOff();
                else if(lastSeen && !OpenFIREdiamond.seen())
                    OF_RGB::SetLedPackedColor(OF_RGB::IRSeen0Color);
                #endif // LED_ENABLE

            lastSeen = OpenFIREdiamond.seen();
        }
    } else {
        if(lastSeen != OpenFIREsquare.seen()) {
            #ifdef MAMEHOOKER
            if(!OF_Serial::serialMode) {
            #endif // MAMEHOOKER
                #ifdef LED_ENABLE
                if(!lastSeen && OpenFIREsquare.seen())
                    OF_RGB::LedOff();
                else if(lastSeen && !OpenFIREsquare.seen())
                    OF_RGB::SetLedPackedColor(OF_RGB::IRSeen0Color);
                #endif // LED_ENABLE
            #ifdef MAMEHOOKER
            }
            #endif // MAMEHOOKER
            lastSeen = OpenFIREsquare.seen();
        }
    }
}

bool FW_Common::SelectCalProfile(const int &profile)
{
    if(profile >= PROFILE_COUNT)
        return false;

